In [2]:
people= {"first" : ["agung","kurao","mandako"],
        "last":["dwipa","anas","anas"],
        "email": ["agungdwipa@gmail.com","kuraoanas@gmail.com","mandakoanas@gmail.com"]}

In [3]:
import pandas as pd
data = pd.DataFrame(people)

In [4]:
data

     first   last                  email
0    agung  dwipa   agungdwipa@gmail.com
1    kurao   anas    kuraoanas@gmail.com
2  mandako   anas  mandakoanas@gmail.com

In [26]:
data["full_name"] = data["first"] + " " + data["last"]

In [27]:
data

     first   last                  email     full_name
0    agung  dwipa   agungdwipa@gmail.com   agung dwipa
1    kurao   anas    kuraoanas@gmail.com    kurao anas
2  mandako   anas  mandakoanas@gmail.com  mandako anas

In [28]:
data.drop(columns=["first","last"],inplace=True)

In [29]:
data

                   email     full_name
0   agungdwipa@gmail.com   agung dwipa
1    kuraoanas@gmail.com    kurao anas
2  mandakoanas@gmail.com  mandako anas

In [31]:
data["full_name"].str.split(" ",expand=True)

         0      1
0    agung  dwipa
1    kurao   anas
2  mandako   anas